
#define key1   digitalRead(A0)     //key1 اردوینو با A0 برابر قرار دادن پین//
#define key2   digitalRead(A1)     //key2 اردوینو با A1 برابر قرار دادن پین//
#define key3   digitalRead(A2)     //key3 اردوینو با A2 برابر قرار دادن پین//

void setup() {

  pinMode(A0, INPUT);   //از خط 8 تا 10 پینهایی از برد اردوینو که به کلیدها متصل می شود را ورودی کرده ایم//
  pinMode(A1, INPUT);
  pinMode(A2, INPUT);
  pinMode(0, OUTPUT);   //ها متصل شوند را خروجی کرده ایم led از خط 11 تا 18 پین هایی از برد اردوینو که باید به//
  pinMode(1, OUTPUT);
  pinMode(2, OUTPUT);
  pinMode(3, OUTPUT);
  pinMode(4, OUTPUT);
  pinMode(5, OUTPUT);
  pinMode(6, OUTPUT);
  pinMode(7, OUTPUT);

}

void loop() {
  int  i, a;    //int از نوع a و i تعریف دو متغیر//
  //در زیر ما سه ارایه دوبعدی تعریف کرده ایم که شامل حالات مختلف رقص نور می باشند. با تغییر مقادیر زیر می توانید حالات جدیدی از رقص نور ایجاد کنید//
  int dancinglight1[ 8 ][ 8 ] = {     
    { 0, 0, 0, 0, 0, 0, 0, 1 },
    { 0, 0, 0, 0, 0, 0, 1, 0 },
    { 0, 0, 0, 0, 0, 1, 0, 0 },
    { 0, 0, 0, 0, 1, 0, 0, 0 },
    { 0, 0, 0, 1, 0, 0, 0, 0 },
    { 0, 0, 1, 0, 0, 0, 0, 0 },
    { 0, 1, 0, 0, 0, 0, 0, 0 },
    { 1, 0, 0, 0, 0, 0, 0, 0 }
  };

  int dancinglight2[ 4 ][ 8 ] = {
    { 0, 0, 0, 1, 1, 0, 0, 0 },
    { 0, 0, 1, 0, 0, 1, 0, 0 },
    { 0, 1, 0, 0, 0, 0, 1, 0 },
    { 1, 0, 0, 0, 0, 0, 0, 1 }
  };

  int dancinglight3[ 2 ][ 8 ] = {
    { 1, 0, 1, 0, 1, 0, 1, 0 },
    { 0, 1, 0, 1, 0, 1, 0, 1 }
  };

  for (i = 0; i <= 7; i++) {          //ها را خاموش می کندled دستور روبرو در حالتی که هیچ کدام از کلیدها زده نشده تمام//
    digitalWrite(i, 0);
  }
  //اجرا می شود dancinglight1 استفاده شده حالت های رقص نور موجود در ارایه for زیر می شویم و با توجه به حلقه های if در صورتی که کلید 1 زده شد وارد شرط//
  if (key1 == 0) {                   //
    for (a = 0; (a <8); a++) {
      for (i = 0; i <8 ; i++) {
        digitalWrite(i, dancinglight1[a][i]);
      }
      delay(200);
    }
  }
  //اجرا می شود dancinglight2 استفاده شده حالت های رقص نور موجود در ارایه for زیر می شویم و با توجه به حلقه های if در صورتی که کلید 2 زده شد وارد شرط//
 // if (key2 == 0) {
    for (a = 0; (a <8) ; a++) {
      for (i = 0; i <8 ; i++) {
        digitalWrite(i, dancinglight2[a][i]);
      }
      delay(300);
    }
  }
  //اجرا می شود dancinglight3 استفاده شده حالت های رقص نور موجود در ارایه for زیر می شویم و با توجه به حلقه های if در صورتی که کلید 3 زده شد وارد شرط//
